shozaburo-shimada/ST_Drone_FCU_F401/STM32 FW Project/Official latest release 221117/Src/main.c
        sensor_init_cali_count = 0;
        sensor_init_cali = 1;
      }
    }
  }

  // 初期化終了後から実行
  if (sensor_init_cali == 1)
  {
    tim9_cnt++;
    tim9_cnt2++;

    // 加速度、ジャイロ、磁気、気圧データをセンサーから取得
    ReadSensorRawData(LSM6DSL_X_0_handle, LSM6DSL_G_0_handle, LIS2MDL_M_0_handle, LPS22HB_P_0_handle, &acc, &gyro, &mag, &pre);

    // プロボでスティック操作されたときに、再度オフセット取得
    if (rc_cal_flag == 1)
    {
      acc_off_calc.AXIS_X += acc.AXIS_X;
      acc_off_calc.AXIS_Y += acc.AXIS_Y;
      acc_off_calc.AXIS_Z += acc.AXIS_Z;

      gyro_off_calc.AXIS_X += gyro.AXIS_X;
      gyro_off_calc.AXIS_Y += gyro.AXIS_Y;
      gyro_off_calc.AXIS_Z += gyro.AXIS_Z;

      rc_cal_cnt++;

      if (rc_cal_cnt >= 800)
      {
        acc_offset.AXIS_X = acc_off_calc.AXIS_X * 0.00125;
        acc_offset.AXIS_Y = acc_off_calc.AXIS_Y * 0.00125;
        acc_offset.AXIS_Z = acc_off_calc.AXIS_Z * 0.00125;

        gyro_offset.AXIS_X = gyro_off_calc.AXIS_X * 0.00125;
        gyro_offset.AXIS_Y = gyro_off_calc.AXIS_Y * 0.00125;
        gyro_offset.AXIS_Z = gyro_off_calc.AXIS_Z * 0.00125;

        acc_off_calc.AXIS_X = 0;
        acc_off_calc.AXIS_Y = 0;
        acc_off_calc.AXIS_Z = 0;
        gyro_off_calc.AXIS_X = 0;
        gyro_off_calc.AXIS_Y = 0;
        gyro_off_calc.AXIS_Z = 0;

        rc_cal_cnt = 0;
        rc_cal_flag = 0;
      }
    }

    // オフセットを引いて校正
    acc.AXIS_X -= acc_offset.AXIS_X;
    acc.AXIS_Y -= acc_offset.AXIS_Y;
    acc.AXIS_Z -= (acc_offset.AXIS_Z - 1000);
    gyro.AXIS_X -= gyro_offset.AXIS_X;
    gyro.AXIS_Y -= gyro_offset.AXIS_Y;
    gyro.AXIS_Z -= gyro_offset.AXIS_Z;

    // 加速度データをFIFOへ格納
    acc_FIFO[tim9_cnt2 - 1].AXIS_X = acc.AXIS_X;
    acc_FIFO[tim9_cnt2 - 1].AXIS_Y = acc.AXIS_Y;
    acc_FIFO[tim9_cnt2 - 1].AXIS_Z = acc.AXIS_Z;

    // ジャイロデータgyro.AXIS_X...をフィルタ処理（IIR）
    gyro_fil.AXIS_X = gyro_fil_coeff.b0 * gyro.AXIS_X + gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_X + gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_X + gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_X + gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_X;
    gyro_fil.AXIS_Y = gyro_fil_coeff.b0 * gyro.AXIS_Y + gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_Y + gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_Y + gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_Y + gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_Y;
    gyro_fil.AXIS_Z = gyro_fil_coeff.b0 * gyro.AXIS_Z + gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_Z + gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_Z + gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_Z + gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_Z;
    // Shift IIR filter state
    for (int i = 1; i > 0; i--)
    {
      gyro_x_pre[i].AXIS_X = gyro_x_pre[i - 1].AXIS_X;
      gyro_x_pre[i].AXIS_Y = gyro_x_pre[i - 1].AXIS_Y;
      gyro_x_pre[i].AXIS_Z = gyro_x_pre[i - 1].AXIS_Z;
      gyro_y_pre[i].AXIS_X = gyro_y_pre[i - 1].AXIS_X;
      gyro_y_pre[i].AXIS_Y = gyro_y_pre[i - 1].AXIS_Y;
      gyro_y_pre[i].AXIS_Z = gyro_y_pre[i - 1].AXIS_Z;
    }
    gyro_x_pre[0].AXIS_X = gyro.AXIS_X;
    gyro_x_pre[0].AXIS_Y = gyro.AXIS_Y;
    gyro_x_pre[0].AXIS_Z = gyro.AXIS_Z;
    gyro_y_pre[0].AXIS_X = gyro_fil.AXIS_X;
    gyro_y_pre[0].AXIS_Y = gyro_fil.AXIS_Y;
    gyro_y_pre[0].AXIS_Z = gyro_fil.AXIS_Z;

    // 最終的なジャイロデータをFIFOへ格納
    gyro_FIFO[tim9_cnt2 - 1].AXIS_X = gyro_fil.AXIS_X;
    gyro_FIFO[tim9_cnt2 - 1].AXIS_Y = gyro_fil.AXIS_Y;
    gyro_FIFO[tim9_cnt2 - 1].AXIS_Z = gyro_fil.AXIS_Z;

    // FIFOバッファがいっぱいになったとき（5個）の処理、tim9_event_flagを立てる。
    // 800Hzの処理で5回に1回flagが立つので、tim9_event_flagは160Hz処理になる
    if (tim9_cnt2 == FIFO_Order)
    {
      tim9_cnt2 = 0;
      tim9_event_flag = 1;
      for (int i = 0; i < FIFO_Order; i++)
      {
        acc_ahrs_FIFO[i].AXIS_X = acc_FIFO[i].AXIS_X;
        acc_ahrs_FIFO[i].AXIS_Y = acc_FIFO[i].AXIS_Y;
        acc_ahrs_FIFO[i].AXIS_Z = acc_FIFO[i].AXIS_Z;
        gyro_ahrs_FIFO[i].AXIS_X = gyro_FIFO[i].AXIS_X;
        gyro_ahrs_FIFO[i].AXIS_Y = gyro_FIFO[i].AXIS_Y;
        gyro_ahrs_FIFO[i].AXIS_Z = gyro_FIFO[i].AXIS_Z;
      }
    }

    // degree/sec から rad/sec へ変換
    gyro_rad.gx = gyro_fil.AXIS_X * COE_MDPS_TO_RADPS;
    gyro_rad.gy = gyro_fil.AXIS_Y * COE_MDPS_TO_RADPS;
    gyro_rad.gz = gyro_fil.AXIS_Z * COE_MDPS_TO_RADPS;
    // Z軸の角速度を積分して、Z軸周りのオイラー角（水平面内での向き）を算出
    euler_ahrs.thz += gyro_rad.gz * PID_SAMPLING_TIME;

    // プロボのスティックの操作量（gTHR）が、しきい値未満なら、姿勢目標値をゼロクリア
    if (gTHR < MIN_THR)
    {
      euler_rc.thz = 0;
      euler_ahrs.thz = 0;
    }

    // 「プロボとの接続が正常」かつ「モーターが動作可能状態」
    if (rc_connection_flag && rc_enable_motor)
    {
      // Inter Loop, 最終的に目標motor_pwmを得る
      FlightControlPID_innerLoop(&euler_rc_fil, &gyro_rad, &ahrs, &pid, &motor_pwm);
    }
    else
    {
      // そうじゃないならモーターを止める
      set_motor_pwm_zero(&motor_pwm);
    }

    if (gTHR < MIN_THR)
    {
      set_motor_pwm_zero(&motor_pwm);
    }

    set_motor_pwm(&motor_pwm); /* To comment if want to debug remocon calibration switching off the motors */
  }
}

/**
 * @brief  Initialize all sensors
 * @param  None
 * @retval None
 */
static void initializeAllSensors(void)
{
  if (BSP_ACCELERO_Init(LSM6DSL_X_0, &LSM6DSL_X_0_handle) != COMPONENT_OK)
  {
    while (1)
      ;
  }

  if (BSP_GYRO_Init(LSM6DSL_G_0, &LSM6DSL_G_0_handle) != COMPONENT_OK)
  {
    while (1)
      ;
  }

  if (BSP_MAGNETO_Init(LIS2MDL_M_0, &LIS2MDL_M_0_handle) != COMPONENT_OK)
  {
    while (1)
      ;
  }

  if (BSP_PRESSURE_Init(LPS22HB_P_0, &LPS22HB_P_0_handle) != COMPONENT_OK)
  {
    while (1)
      ;
  }

  //  if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK)
  //  {
  //    while(1);
  //  }
  //
}

/**
 * @brief  Enable all sensors
 * @param  None
 * @retval None
 */
void enableAllSensors(void)
{
  BSP_ACCELERO_Sensor_Enable(LSM6DSL_X_0_handle);
  PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n");
  BSP_GYRO_Sensor_Enable(LSM6DSL_G_0_handle);
  PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n");
  BSP_MAGNETO_Sensor_Enable(LIS2MDL_M_0_handle);
  PRINTF("LIS2MDL Magnetometer initialized and enabled\n");
  BSP_PRESSURE_Sensor_Enable(LPS22HB_P_0_handle);
  PRINTF("LPS22HB Pressure sensor initialized and enabled\n");
  //  BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
}

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
